# Author: Jintao Huang
# Email: hjt_study@qq.com
# Date:


"""P46 双指针
双指针分类:
1. 普通双指针: 两指针往同一方向移动
-
2. 对撞双指针: 两指针面对面移动
- 快排; 需有序(两数之和); 逆序
3. 快慢双指针: 慢指针 + 快指针
- 链表中点; 环形指针

三指针: merge

题型: 141 161/1 881
"""

"""P49 二分查找法
使用条件：
1. 需要有序

题：704 35 162 74
"""

"""P54 滑动窗口
应用场景：
1. 连续
2. 定长

题：209 1456
"""

"""P57 递归
递归的应用：
1. 回溯
2. 深度优先搜索
3. 分治法

递归四个要素：
1. 参数
2. 返回值
*3. 终止条件
4. 递归拆解

递归树

递归的空间复杂度: 递归最大的深度 * 递归函数的Os + 递归函数调用的其他函数的Os
1. e.g: 归并: Os(LogN * 1 + N) = Os(N)

题：509 206 344
"""

"""P61 分治法
思想：
1. 大问题 分解为 多个小问题
2. 将多个小问题的解 合并为 大问题的解

例子：归并排序

题：169 53 215
"""
